{"pages":[],"posts":[{"title":"公司","text":"","link":"/2021/04/09/company/"},{"title":"示例","text":"欢迎来到项圣云的个人站@(Sample notebook)[Marxico|Manual|Markdown]http://marxi.co/Marxico is a delicate Markdown editor for Evernote. With reliable storage and sync powered by Evernote, Marxico offers greate writing experience. Versatile - supporting code highlight, LaTeX &amp; flow charts, inserting images &amp; attachments by all means. Exquisite - neat but powerful editor, featuring offline docs, live preview, and offering the desktop client and offline Chrome App. Sophisticated - deeply integrated with Evernote, supporting notebook &amp; tags, two-way bind editing. [TOC] Introducing Markdown Markdown is a plain text formatting syntax designed to be converted to HTML. Markdown is popularly used as format for readme files, … or in text editors for the quick creation of rich text documents. - Wikipedia As showed in this manual, it uses hash(#) to identify headings, emphasizes some text to be bold or italic. You can insert a link , or a footnote[^demo]. Serveral advanced syntax are listed below, please press Ctrl + / to view Markdown cheatsheet. Code block12345678910@requires_authorizationdef somefunc(param1='', param2=0): '''A docstring''' if param1 &gt; param2: # interesting print 'Greater' return (param2 - param1 + 1) or Noneclass SomeClass: pass&gt;&gt;&gt; message = '''interpreter... prompt''' LaTeX expression$$ x = \\dfrac{-b \\pm \\sqrt{b^2 - 4ac}}{2a} $$ Table Item Value Qty Computer 1600 USD 5 Phone 12 USD 12 Pipe 1 USD 234 DiagramsFlow charts12345678st=&gt;start: Starte=&gt;endop=&gt;operation: My Operationcond=&gt;condition: Yes or No?st-&gt;op-&gt;condcond(yes)-&gt;econd(no)-&gt;op Sequence diagrams123Alice-&gt;Bob: Hello Bob, how are you?Note right of Bob: Bob thinksBob--&gt;Alice: I am good thanks! Note: You can find more information: about Sequence diagrams syntax here, about Flow charts syntax here. CheckboxYou can use - [ ] and - [x] to create checkboxes, for example: Item1 Item2 Item3 Note: Currently it is only partially supported. You can’t toggle checkboxes in Evernote. You can only modify the Markdown in Marxico to do that. Next version will fix this. Dancing with EvernoteNotebook &amp; TagsMarxico add @(Notebook)[tag1|tag2|tag3] syntax to select notebook and set tags for the note. After typing @(, the notebook list would appear, please select one from it. TitleMarxico would adopt the first heading encountered as the note title. For example, in this manual the first line Welcome to Marxico is the title. Quick EditingNote saved by Marxico in Evernote would have a red ribbon button on the top-right corner. Click it and it would bring you back to Marxico to edit the note. Note: Currently Marxico is unable to detect and merge any modifications in Evernote by user. Please go back to Marxico to edit. Data SynchronizationWhile saving rich HTML content in Evernote, Marxico puts the Markdown text in a hidden area of the note, which makes it possible to get the original text in Marxico and edit it again. This is a really brilliant design because: it is beyond just one-way exporting HTML which other services do; and it avoids privacy and security problems caused by storing content in a intermediate server. Privacy Statement: All of your notes data are saved in Evernote. Marxico doesn’t save any of them. Offline StorageMarxico stores your unsynchronized content locally in browser storage, so no worries about network and broswer crash. It also keeps the recent file list you’ve edited in Document Management(Ctrl + O). Note: Although browser storage is reliable in the most time, Evernote is born to do that. So please sync the document regularly while writing. ShortcutsHelp Ctrl + /Sync Doc Ctrl + SCreate Doc Ctrl + Alt + NMaximize Editor Ctrl + EnterPreview Doc Ctrl + Alt + EnterDoc Management Ctrl + OMenu Ctrl + M Bold Ctrl + BInsert Image Ctrl + GInsert Link Ctrl + LConvert Heading Ctrl + H About ProMarixo offers a free trial of 10 days. After that, you need to purchase the Pro service. Otherwise, you would not be able to sync new notes. Previous notes can be edited and synced all the time. CreditsMarxico was first built upon Dillinger, and the newest version is almost based on the awesome StackEdit. Acknowledgments to them and other incredible open source projects! Feedback &amp; Bug Report Twitter: @gock2 Email: hustgock@gmail.com Thank you for reading this manual. Now please press Ctrl + M and click Link with Evernote. Enjoy your Marxico journey! [^demo]: This is a demo footnote. Read the MultiMarkdown Syntax Guide to learn more. Note that Evernote disables ID attributes in its notes , so footnote and TOC are not actually working.","link":"/2021/04/09/example/"},{"title":"欢迎","text":"欢迎来到-项圣云-的主页！","link":"/2021/04/09/welcome/"}],"tags":[],"categories":[]}